Aliguzel01/STM32-peripherals/time_base_100ms_IT/Src/main.c
/*
 * main.c
 *
 *  Created on: 1 Eki 2020
 *      Author: HP
 */
#include "main.h"
#include "stm32f4xx_hal.h"
#include<string.h>

void SystemClockConfig(void);
void TIMER6_Init(void);
void Error_handler(void);
void GPIO_Init(void);


TIM_HandleTypeDef htimer6;

int main(void)
{
	HAL_Init();
	SystemClockConfig();
	GPIO_Init();
	TIMER6_Init();
	// Interrupt mode Zamanlayýcýyý baþlatalým
	HAL_TIM_Base_Start_IT(&htimer6);


	while(1);

	return 0;
}

void SystemClockConfig(void)
{

}

void GPIO_Init(void)
{
    __HAL_RCC_GPIOA_CLK_ENABLE();
	GPIO_InitTypeDef ledgpio;
	ledgpio.Pin = GPIO_PIN_5;
	ledgpio.Mode = GPIO_MODE_OUTPUT_PP;
	ledgpio.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOA,&ledgpio);

}


void TIMER6_Init(void)
{
	htimer6.Instance=TIM6;
	htimer6.Init.Prescaler=24;
	htimer6.Init.Period=64000-1;

	if( HAL_TIM_Base_Init(&htimer6) != HAL_OK )
	{
		Error_handler();
	}
}


void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  HAL_GPIO_TogglePin(GPIOA,GPIO_PIN_5);
}


void Error_handler(void)
{
	while(1);
}

